/*
 * list7_3.c
 *
 *  Created on: 2021/11/08
 *      Author: h30m21 M4-24 齋藤唯維
 */

#include<stdio.h>

int main(void){

	int x[] = {30,25,33,15,22};
	int *p,i;

	for(i = 0; i < 5; i++)
		printf("&x[%d] = %d\n",i,&x[i]);
		printf("\n");

	p = x;
	printf("p = %d,*p = %d\n",p,*p );

	for(i = 0; i < 5; i++)
		printf("*(p+%d) = %d,(p+%d) = %d\n",i,*p++, i, p+i);

		printf("\n p++ を使用した場合\n");

	for(i=0;i<5;i++){
		printf("*p=%d,p=%d",*p,p);
		p++;
	}

	return 0;
}

/*
&x[0] = 2293328
&x[1] = 2293332
&x[2] = 2293336
&x[3] = 2293340
&x[4] = 2293344

p = 2293328,*p = 30
*(p+0) = 30,(p+0) = 2293328
*(p+1) = 25,(p+1) = 2293336
*(p+2) = 33,(p+2) = 2293344
*(p+3) = 15,(p+3) = 2293352
*(p+4) = 22,(p+4) = 2293360

 p++ を使用した場合
*p=0,p=2293348*p=2293352,p=2293352*p=0,p=2293356*p=8,p=2293360*p=0,p=2293364
 */
